application/backend/modules/management/views/userman/_form.php

/* @var $form yii\widgets\ActiveForm */

        use backend\modules\management\models\IndustryPartners;
        $partners=IndustryPartners::find()->all();
---
SELECT * FROM `industry_partners`