practice/kensbyn/controllers/PostsController.php

UPDATE `posts` SET `userid`=1 WHERE `post_id`=1
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `posts` WHERE `post_id`='1'
---
    protected function findModel($id)
    {
        if (($model = Posts::findOne($id)) !== null) {