application/frontend/controllers/SiteController.php

SELECT `id` FROM `student` WHERE `user_id`=58
---
    public function actionSignup()
    {
        $model = new SignupForm();
        if ($model->load(Yii::$app->request->post())) {
            if ($user = $model->signup()) {
                if (Yii::$app->getUser()->login($user)) {
                    if($user->roles = 10){
                        Yii::$app->getSession()->setFlash('error', 'Please complete your account details.');
                        $sel = (new \yii\db\Query())
                            ->select(['id'])
                            ->from('student')
                            ->where(['user_id' => $user->id]);