application/frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `firstname`, `lastname`, `email`, `roles`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('dummyaccnt2', 'dummy', 'account', 'dummy2@account.test', 10, '$2y$13$H9PaJ5sX30vLjnlmyOtbQefG39xLRY3RrcmqPxCkyxBk/ujP45zD.', 'W_wL9ijUdpzXqQU4oZWgA0fuLvEFGBAG', 10, 1426152318, 1426152318)
---
    public function signup()
    {
        if ($this->validate()) {
//            Yii::$app->mailer->compose()
//            ->setFrom([Yii::$app->params['adminEmail'] => 'APC CPO Robot'])
//            ->setTo($this->email)
//            ->setSubject('CPO Website Registration')
//            ->setTextBody('Welcome '.$this->username.'! You have successfully signed up to APC CPO Wesite!')
//            ->send();
            $user = new User();
            $user->username = $this->username;
			$user->firstname = $this->firstname;
			$user->lastname = $this->lastname;
            $user->email = $this->email;
			if($this->roles == 0){
				$user->roles = User::ROLE_USER;
			}else if($this->roles == 1){
				$user->roles = User::ROLE_IP;
			}else{
                $user->roles = User::ROLE_HR;
            }
            $user->setPassword($this->password);
            $user->generateAuthKey();
            if ($user->save()) {